; domain
(define (domain Depot)
;(:requirements :typing :fluents)
(:types place locatable - object
		depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place) 
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface)
)

(:functions 
	(load_limit ?t - truck) 
	(current_load ?t - truck) 
	(weight ?c - crate)
	(fuel-cost)
)
	
(:action Drive
:parameters (?x - truck ?y - place ?z - place) 
:precondition (and (at ?x ?y))
:effect (and (not (at ?x ?y)) (at ?x ?z)
		(increase (fuel-cost) 10)))

(:action Lift
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
:effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) 
             (clear ?z) (not (on ?y ?z)) (increase (fuel-cost) 1)))

(:action Drop 
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
:effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)
		(on ?y ?z)))

(:action Load
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y)
		(<= (+ (current_load ?z) (weight ?y)) (load_limit ?z)))
:effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)
		(increase (current_load ?z) (weight ?y))))

(:action Unload 
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
:effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)
		(decrease (current_load ?z) (weight ?y))))

)

; problem
(define (problem depotprob49) (:domain depot)
(:objects
	depot0 depot1 depot2 - depot
	distributor0 distributor1 distributor2 - distributor
	truck0 truck1 - truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 pallet8 pallet9 pallet10 pallet11 pallet12 - pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 crate8 - crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 hoist7 hoist8 hoist9 - hoist)
(:init
	(at pallet0 depot0)
	(clear crate4)
	(at pallet1 depot1)
	(clear pallet1)
	(at pallet2 depot2)
	(clear crate7)
	(at pallet3 distributor0)
	(clear pallet3)
	(at pallet4 distributor1)
	(clear pallet4)
	(at pallet5 distributor2)
	(clear crate0)
	(at pallet6 distributor2)
	(clear pallet6)
	(at pallet7 distributor2)
	(clear crate1)
	(at pallet8 distributor1)
	(clear pallet8)
	(at pallet9 depot2)
	(clear crate8)
	(at pallet10 distributor0)
	(clear crate3)
	(at pallet11 distributor1)
	(clear pallet11)
	(at pallet12 depot2)
	(clear crate2)
	(at truck0 distributor1)
	(= (current_load truck0) 0)
	(= (load_limit truck0) 449)
	(at truck1 depot0)
	(= (current_load truck1) 0)
	(= (load_limit truck1) 286)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at hoist6 distributor0)
	(available hoist6)
	(at hoist7 depot0)
	(available hoist7)
	(at hoist8 depot2)
	(available hoist8)
	(at hoist9 distributor0)
	(available hoist9)
	(at crate0 distributor2)
	(on crate0 pallet5)
	(= (weight crate0) 12)
	(at crate1 distributor2)
	(on crate1 pallet7)
	(= (weight crate1) 48)
	(at crate2 depot2)
	(on crate2 pallet12)
	(= (weight crate2) 87)
	(at crate3 distributor0)
	(on crate3 pallet10)
	(= (weight crate3) 37)
	(at crate4 depot0)
	(on crate4 pallet0)
	(= (weight crate4) 73)
	(at crate5 depot2)
	(on crate5 pallet9)
	(= (weight crate5) 40)
	(at crate6 depot2)
	(on crate6 pallet2)
	(= (weight crate6) 15)
	(at crate7 depot2)
	(on crate7 crate6)
	(= (weight crate7) 18)
	(at crate8 depot2)
	(on crate8 crate5)
	(= (weight crate8) 70)
	(= (fuel-cost) 0)
)

(:goal (and
		(on crate0 crate4)
		(on crate1 pallet2)
		(on crate2 pallet5)
		(on crate3 crate8)
		(on crate4 crate6)
		(on crate5 pallet8)
		(on crate6 pallet4)
		(on crate8 pallet12)
	)
)

(:metric minimize (total-time)))

; plan
1. (lift hoist3 crate3 pallet10 distributor0)
   deleted: (at crate3 distributor0) (clear crate3) (available hoist3) (on crate3 pallet10)
   added: (lifting hoist3 crate3) (clear pallet10)
   changed: (fuel-cost) from 0 to 1
   goals met: 0 of 8
2. (lift hoist8 crate8 crate5 depot2)
   deleted: (at crate8 depot2) (clear crate8) (available hoist8) (on crate8 crate5)
   added: (lifting hoist8 crate8) (clear crate5)
   changed: (fuel-cost) from 1 to 2
   goals met: 0 of 8
3. (lift hoist2 crate2 pallet12 depot2)
   deleted: (at crate2 depot2) (clear crate2) (available hoist2) (on crate2 pallet12)
   added: (lifting hoist2 crate2) (clear pallet12)
   changed: (fuel-cost) from 2 to 3
   goals met: 0 of 8
4. (drop hoist8 crate8 pallet12 depot2)
   deleted: (lifting hoist8 crate8) (clear pallet12)
   added: (available hoist8) (at crate8 depot2) (clear crate8) (on crate8 pallet12)
   goals met: 1 of 8
5. (drive truck0 distributor1 distributor0)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 3 to 13
   goals met: 1 of 8
6. (load hoist3 crate3 truck0 distributor0)
   deleted: (lifting hoist3 crate3)
   added: (in crate3 truck0) (available hoist3)
   changed: (current_load truck0) from 0 to 37
   goals met: 1 of 8
7. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 13 to 23
   goals met: 1 of 8
8. (drive truck0 depot0 depot2)
   deleted: (at truck0 depot0)
   added: (at truck0 depot2)
   changed: (fuel-cost) from 23 to 33
   goals met: 1 of 8
9. (load hoist2 crate2 truck0 depot2)
   deleted: (lifting hoist2 crate2)
   added: (in crate2 truck0) (available hoist2)
   changed: (current_load truck0) from 37 to 124
   goals met: 1 of 8
10. (unload hoist2 crate3 truck0 depot2)
   deleted: (in crate3 truck0) (available hoist2)
   added: (lifting hoist2 crate3)
   changed: (current_load truck0) from 124 to 87
   goals met: 1 of 8
11. (drop hoist2 crate3 crate8 depot2)
   deleted: (lifting hoist2 crate3) (clear crate8)
   added: (available hoist2) (at crate3 depot2) (clear crate3) (on crate3 crate8)
   goals met: 2 of 8
12. (lift hoist8 crate7 crate6 depot2)
   deleted: (at crate7 depot2) (clear crate7) (available hoist8) (on crate7 crate6)
   added: (lifting hoist8 crate7) (clear crate6)
   changed: (fuel-cost) from 33 to 34
   goals met: 2 of 8
13. (lift hoist2 crate5 pallet9 depot2)
   deleted: (at crate5 depot2) (clear crate5) (available hoist2) (on crate5 pallet9)
   added: (lifting hoist2 crate5) (clear pallet9)
   changed: (fuel-cost) from 34 to 35
   goals met: 2 of 8
14. (load hoist2 crate5 truck0 depot2)
   deleted: (lifting hoist2 crate5)
   added: (in crate5 truck0) (available hoist2)
   changed: (current_load truck0) from 87 to 127
   goals met: 2 of 8
15. (drive truck0 depot2 distributor1)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 35 to 45
   goals met: 2 of 8
16. (unload hoist4 crate5 truck0 distributor1)
   deleted: (in crate5 truck0) (available hoist4)
   added: (lifting hoist4 crate5)
   changed: (current_load truck0) from 127 to 87
   goals met: 2 of 8
17. (drop hoist4 crate5 pallet8 distributor1)
   deleted: (lifting hoist4 crate5) (clear pallet8)
   added: (available hoist4) (at crate5 distributor1) (clear crate5) (on crate5 pallet8)
   goals met: 3 of 8
18. (lift hoist5 crate0 pallet5 distributor2)
   deleted: (at crate0 distributor2) (clear crate0) (available hoist5) (on crate0 pallet5)
   added: (lifting hoist5 crate0) (clear pallet5)
   changed: (fuel-cost) from 45 to 46
   goals met: 3 of 8
19. (drive truck0 distributor1 distributor2)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor2)
   changed: (fuel-cost) from 46 to 56
   goals met: 3 of 8
20. (load hoist5 crate0 truck0 distributor2)
   deleted: (lifting hoist5 crate0)
   added: (in crate0 truck0) (available hoist5)
   changed: (current_load truck0) from 87 to 99
   goals met: 3 of 8
21. (unload hoist5 crate2 truck0 distributor2)
   deleted: (in crate2 truck0) (available hoist5)
   added: (lifting hoist5 crate2)
   changed: (current_load truck0) from 99 to 12
   goals met: 3 of 8
22. (drop hoist5 crate2 pallet5 distributor2)
   deleted: (lifting hoist5 crate2) (clear pallet5)
   added: (available hoist5) (at crate2 distributor2) (clear crate2) (on crate2 pallet5)
   goals met: 4 of 8
23. (lift hoist5 crate1 pallet7 distributor2)
   deleted: (at crate1 distributor2) (clear crate1) (available hoist5) (on crate1 pallet7)
   added: (lifting hoist5 crate1) (clear pallet7)
   changed: (fuel-cost) from 56 to 57
   goals met: 4 of 8
24. (load hoist5 crate1 truck0 distributor2)
   deleted: (lifting hoist5 crate1)
   added: (in crate1 truck0) (available hoist5)
   changed: (current_load truck0) from 12 to 60
   goals met: 4 of 8
25. (drive truck0 distributor2 depot0)
   deleted: (at truck0 distributor2)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 57 to 67
   goals met: 4 of 8
26. (unload hoist0 crate0 truck0 depot0)
   deleted: (in crate0 truck0) (available hoist0)
   added: (lifting hoist0 crate0)
   changed: (current_load truck0) from 60 to 48
   goals met: 4 of 8
27. (lift hoist2 crate6 pallet2 depot2)
   deleted: (at crate6 depot2) (clear crate6) (available hoist2) (on crate6 pallet2)
   added: (lifting hoist2 crate6) (clear pallet2)
   changed: (fuel-cost) from 67 to 68
   goals met: 4 of 8
28. (drive truck0 depot0 depot2)
   deleted: (at truck0 depot0)
   added: (at truck0 depot2)
   changed: (fuel-cost) from 68 to 78
   goals met: 4 of 8
29. (load hoist2 crate6 truck0 depot2)
   deleted: (lifting hoist2 crate6)
   added: (in crate6 truck0) (available hoist2)
   changed: (current_load truck0) from 48 to 63
   goals met: 4 of 8
30. (drive truck0 depot2 depot0)
   deleted: (at truck0 depot2)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 78 to 88
   goals met: 4 of 8
31. (unload hoist7 crate6 truck0 depot0)
   deleted: (in crate6 truck0) (available hoist7)
   added: (lifting hoist7 crate6)
   changed: (current_load truck0) from 63 to 48
   goals met: 4 of 8
32. (drive truck0 depot0 depot2)
   deleted: (at truck0 depot0)
   added: (at truck0 depot2)
   changed: (fuel-cost) from 88 to 98
   goals met: 4 of 8
33. (unload hoist2 crate1 truck0 depot2)
   deleted: (in crate1 truck0) (available hoist2)
   added: (lifting hoist2 crate1)
   changed: (current_load truck0) from 48 to 0
   goals met: 4 of 8
34. (drop hoist2 crate1 pallet2 depot2)
   deleted: (lifting hoist2 crate1) (clear pallet2)
   added: (available hoist2) (at crate1 depot2) (clear crate1) (on crate1 pallet2)
   goals met: 5 of 8
35. (load hoist7 crate6 truck1 depot0)
   deleted: (lifting hoist7 crate6)
   added: (in crate6 truck1) (available hoist7)
   changed: (current_load truck1) from 0 to 15
   goals met: 5 of 8
36. (drive truck1 depot0 distributor1)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor1)
   changed: (fuel-cost) from 98 to 108
   goals met: 5 of 8
37. (unload hoist4 crate6 truck1 distributor1)
   deleted: (in crate6 truck1) (available hoist4)
   added: (lifting hoist4 crate6)
   changed: (current_load truck1) from 15 to 0
   goals met: 5 of 8
38. (drop hoist4 crate6 pallet4 distributor1)
   deleted: (lifting hoist4 crate6) (clear pallet4)
   added: (available hoist4) (at crate6 distributor1) (clear crate6) (on crate6 pallet4)
   goals met: 6 of 8
39. (drive truck0 depot2 depot0)
   deleted: (at truck0 depot2)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 108 to 118
   goals met: 6 of 8
40. (lift hoist7 crate4 pallet0 depot0)
   deleted: (at crate4 depot0) (clear crate4) (available hoist7) (on crate4 pallet0)
   added: (lifting hoist7 crate4) (clear pallet0)
   changed: (fuel-cost) from 118 to 119
   goals met: 6 of 8
41. (load hoist7 crate4 truck0 depot0)
   deleted: (lifting hoist7 crate4)
   added: (in crate4 truck0) (available hoist7)
   changed: (current_load truck0) from 0 to 73
   goals met: 6 of 8
42. (drive truck0 depot0 distributor1)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 119 to 129
   goals met: 6 of 8
43. (unload hoist4 crate4 truck0 distributor1)
   deleted: (in crate4 truck0) (available hoist4)
   added: (lifting hoist4 crate4)
   changed: (current_load truck0) from 73 to 0
   goals met: 6 of 8
44. (drive truck0 distributor1 depot0)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 129 to 139
   goals met: 6 of 8
45. (drop hoist4 crate4 crate6 distributor1)
   deleted: (lifting hoist4 crate4) (clear crate6)
   added: (available hoist4) (at crate4 distributor1) (clear crate4) (on crate4 crate6)
   goals met: 7 of 8
46. (load hoist0 crate0 truck0 depot0)
   deleted: (lifting hoist0 crate0)
   added: (in crate0 truck0) (available hoist0)
   changed: (current_load truck0) from 0 to 12
   goals met: 7 of 8
47. (drive truck0 depot0 distributor1)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 139 to 149
   goals met: 7 of 8
48. (unload hoist4 crate0 truck0 distributor1)
   deleted: (in crate0 truck0) (available hoist4)
   added: (lifting hoist4 crate0)
   changed: (current_load truck0) from 12 to 0
   goals met: 7 of 8
49. (drop hoist4 crate0 crate4 distributor1)
   deleted: (lifting hoist4 crate0) (clear crate4)
   added: (available hoist4) (at crate0 distributor1) (clear crate0) (on crate0 crate4)
   goals met: 8 of 8
